<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 7, 2026, 02:40 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "42:95:16:EA:31:20" -> "96:35:E7:B7:C1:2F",
          ~ "96:3E:E1:95:EE:8E" -> "B2:EC:2C:8F:3D:B0",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          ~ "eth0" -> "ens18",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_iso" {
      ~ file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply) # forces replacement
      ~ id                  = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
      ~ size                = 315961344 -> (known after apply)
      ~ url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # talos_image_factory_schematic.metal_amd will be updated in-place
  ~ resource "talos_image_factory_schematic" "metal_amd" {
      ~ id        = "a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a" -> (known after apply)
      ~ schematic = <<-EOT
            "customization":
              "extraKernelArgs":
          +   - "net.ifnames=0"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/amdgpu"
                - "siderolabs/amd-ucode"
        EOT
    }

  # talos_image_factory_schematic.vm will be updated in-place
  ~ resource "talos_image_factory_schematic" "vm" {
      ~ id        = "10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67" -> (known after apply)
      ~ schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "vga=792"
          +   - "net.ifnames=0"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/qemu-guest-agent"
        EOT
    }

  # module.cluster.onepassword_item.misc_config will be updated in-place
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/txizvv5dzvi7kbg5ktq5ngjpsi"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "ab2a327c-f3a1-12c9-8d38-26da063ef8cb"
            # (1 unchanged attribute hidden)

          ~ field {
                id    = "ead1b4df-21aa-8fa4-2381-ebb43c21f3dd"
              ~ value = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (13 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cluster.module.talos-amd-metal["lancer"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    # extraKernelArgs are set in the schematic customization, not here
                    # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + (known after apply),
          + <<-EOT
                "machine":
                  "kubelet":
                    "extraArgs":
                      "register-with-taints": "dedicated=nodeodm:NoSchedule"
            EOT,
        ]
      + endpoint                    = "10.0.128.51"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.51"
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
        name                                 = "tiles-cp-1"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
            <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.128.10"
            EOT,
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
        name                                 = "tiles-cp-2"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
            <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.128.10"
            EOT,
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
        name                                 = "tiles-cp-3"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
            <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.128.10"
            EOT,
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
        name                                 = "tiles-wk-1"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
        name                                 = "tiles-wk-2"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
        name                                 = "tiles-wk-3"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cdrom {
          ~ file_id   = "local:iso/talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].talos_machine_configuration_apply.this will be replaced due to changes in replace_triggered_by
-/+ resource "talos_machine_configuration_apply" "this" {
      ~ config_patches              = [
          ~ <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
              -     extraKernelArgs:
              -       # 1024x768 for the dashboard:
              -       - vga=792
              -       # Disable predictable network interface names (use eth0, eth1, etc.)
              -       - net.ifnames=0
              -       - -talos.halt_if_installed
              +     # extraKernelArgs are set in the schematic customization, not here
              +     # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
            <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          ~ <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT -> (known after apply),
            <<-EOT
                "machine":
                  "kubelet":
                    "extraArgs":
                      "register-with-taints": "dedicated=nodeodm:NoSchedule"
            EOT,
        ]
      ~ id                          = "machine_configuration_apply" -> (known after apply)
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

Plan: 11 to add, 9 to change, 10 to destroy.

Changes to Outputs:
  ~ metal_amd_iso_url      = "https://factory.talos.dev/image/a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a/v1.12.0/metal-amd64.iso" -> (known after apply)
  ~ metal_amd_schematic_id = "a53e50ce56fa0b0ca1f96d993265508b0608050f6df4b7f4197ef510655d637a" -> (known after apply)
  ~ vm_schematic_id        = "10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67" -> (known after apply)

  ```

  </details>
  
  